Функция ПреобразоватьMJML(ТекстMJML, Сервер, Порт, Путь = "/", ИспользоватьSSL = Истина) Экспорт
	
	Если ИспользоватьSSL Тогда
		SSL = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(Сервер, Порт,,,,, SSL);
	Иначе
		Соединение = Новый HTTPСоединение(Сервер, Порт);
	КонецЕсли;
	ТекстЗапроса = "mjml="+ ТекстMJML;
	Заголовки = Новый Соответствие;    
    Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Запрос = Новый HTTPЗапрос(Путь, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТекстЗапроса);
	Результат = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Если Результат.КодСостояния = 200 Тогда
		Возврат Результат.ПолучитьТелоКакСтроку();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции